In [52]:
import sqlite3
import pandas as pd

In [53]:
con = sqlite3.connect(':memory:')

In [54]:
table_names = [
    'Categories',   # –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Ç–æ–≤–∞—Ä–æ–≤
    'Customers',    # –∑–∞–∫–∞–∑—á–∏–∫–∏
    'Employees',    # —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏
    'OrderDetails', # –¥–µ—Ç–∞–ª–∏ –∑–∞–∫–∞–∑–æ–≤
    'Orders',       # –∑–∞–∫–∞–∑—ã
    'Products',     # —Ç–æ–≤–∞—Ä—ã
    'Shippers',     # –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∏
    'Suppliers',    # –ø–æ—Å—Ç–∞–≤—â–∏–∫–∏
]

In [55]:
for table in table_names:
    data = pd.read_csv(f'{table}.csv', sep = ';')
    data.to_sql(table, con, index=False, if_exists='replace')

In [56]:
pd.read_sql(
    '''
    SELECT * FROM Customers
    ''',
    con,
)

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constituci√≥n 2222,M√©xico D.F.,5021,Mexico
2,3,Antonio Moreno Taquer√≠a,Antonio Moreno,Mataderos 2312,M√©xico D.F.,5023,Mexico
3,4,Around the Horn,Thomas Hardy,120 Hanover Sq.,London,WA1 1DP,UK
4,5,Berglunds snabbk√∂p,Christina Berglund,Berguvsv√§gen 8,Lule√•,S-958 22,Sweden
...,...,...,...,...,...,...,...
86,87,Wartian Herkku,Pirkko Koskitalo,Torikatu 38,Oulu,90110,Finland
87,88,Wellington Importadora,Paula Parente,"Rua do Mercado, 12",Resende,08737-363,Brazil
88,89,White Clover Markets,Karl Jablonski,305 - 14th Ave. S. Suite 3B,Seattle,98128,USA
89,90,Wilman Kala,Matti Karttunen,Keskuskatu 45,Helsinki,21240,Finland
90,91,Wolski,Zbyszek,ul. Filtrowa 68,Walla,01-012,Poland

In [57]:
tasks = 0

In [58]:
#1.–í—ã–±–µ—Ä–∏—Ç–µ –∑–∞–∫–∞–∑—á–∏–∫–æ–≤ –∏–∑ –ì–µ—Ä–º–∞–Ω–∏–∏, –§—Ä–∞–Ω—Ü–∏–∏ –∏ –ú–∞–¥—Ä–∏–¥–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏–µ, —Å—Ç—Ä–∞–Ω—É –∏ –∞–¥—Ä–µ—Å.

tasks+=1
pd.read_sql(
    '''
    SELECT CustomerName, Country, Address    
    FROM Customers                           
    where Country in ('Germany', 'France') or City = 'Madrid'  
    order by Country
    ''',
    con,
)

,CustomerName,Country,Address
0,Blondel p√®re et fils,France,"24, place Kl√©ber"
1,Bon app',France,"12, rue des Bouchers"
2,Du monde entier,France,"67, rue des Cinquante Otages"
3,Folies gourmandes,France,"184, chauss√©e de Tournai"
4,France restauration,France,"54, rue Royale"
5,La corne d'abondance,France,"67, avenue de l'Europe"
6,La maison d'Asie,France,1 rue Alsace-Lorraine
7,Paris sp√©cialit√©s,France,"265, boulevard Charonne"
8,Sp√©cialit√©s du monde,France,"25, rue Lauriston"
9,Victuailles en stock,France,"2, rue du Commerce"
10,Vins et alcools Chevalier,France,59 rue de l'Abbaye
11,Alfreds Futterkiste,Germany,Obere Str. 57
12,Blauer See Delikatessen,Germany,Forsterstr. 57
13,Drachenblut Delikatessend,Germany,Walserweg 21
14,Frankenversand,Germany,Berliner Platz 43
15,K√∂niglich Essen,Germany,Maubelstr. 90
16,Lehmanns Marktstand,Germany,Magazinweg 7
17,Morgenstern Gesundkost,Germany,Heerstr. 22
18,Ottilies K√§seladen,Germany,Mehrheimerstr. 369
19,QUICK-Stop,Germany,Taucherstra√üe 10
20,Toms Spezialit√§ten,Germany,Luisenstr. 48
21,Die Wandernde Kuh,Germany,Adenauerallee 900
22,B√≥lido Comidas preparadas,Spain,"C/ Araquil, 67"
23,FISSA Fabrica Inter. Salchichas S.A.,Spain,"C/ Moralzarzal, 86"
24,Romero y tomillo,Spain,"Gran V√≠a, 1"

In [59]:
#2.–í—ã–±–µ—Ä–∏—Ç–µ —Ç–æ–ø 3 —Å—Ç—Ä–∞–Ω—ã –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑—á–∏–∫–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–ø–∏—Å–µ–π.

tasks+=1
pd.read_sql(
    '''
    SELECT country, COUNT(CustomerName) AS customer_count
    FROM customers
    GROUP BY country
    ORDER BY customer_count DESC
    LIMIT 3;
    ''',
    con,
)

   Country  customer_count
0      USA              13
1  Germany              11
2   France              11

In [60]:
#3.–í—ã–±–µ—Ä–∏—Ç–µ –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∞, –∫–æ—Ç–æ—Ä—ã–π –æ—Ç–ø—Ä–∞–≤–∏–ª 10-–π –ø–æ –≤—Ä–µ–º–µ–Ω–∏ –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ, –∏ –¥–∞—Ç—É –æ—Ç–ø—Ä–∞–≤–ª–µ–Ω–∏—è.

tasks+=1
pd.read_sql(
    '''
    SELECT ShipperName, OrderDate
    FROM (
    SELECT ShipperName, OrderDate, ROW_NUMBER() OVER (ORDER BY OrderDate) AS row_num
    FROM Shippers S left join Orders O on S.ShipperID=O.ShipperID
    ) AS ordered_orders
    WHERE row_num = 10;
    ''',
    con,
)

        ShipperName   OrderDate
0  Federal Shipping  02.10.1996

In [61]:
#4.–í—ã–±–µ—Ä–∏—Ç–µ —Å–∞–º—ã–π –¥–æ—Ä–æ–≥–æ–π –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ —Å–ø–∏—Å–æ–∫ —Ç–æ–≤–∞—Ä–æ–≤ —Å –∏—Ö —Ü–µ–Ω–∞–º–∏.

tasks+=1
pd.read_sql(
    '''
SELECT OD.OrderID, P.ProductID, P.ProductName, OD.Quantity
FROM Products P left join OrderDetails OD on P.ProductID=OD.ProductID
WHERE OD.OrderID = (
  SELECT OrderID
  FROM Products left join OrderDetails on Products.ProductID=OrderDetails.ProductID
  GROUP BY OrderID
  ORDER BY SUM(Price * Quantity) DESC
  LIMIT 1
)
      
    ''',
    con,
)

#–ê–ª–µ–∫—Å–µ–π: –°–∞–º—ã–π –¥–æ—Ä–æ–≥–æ–π –∑–∞–∫–∞–∑ –Ω—É–∂–Ω–æ –æ–ø—Ä–µ–¥–µ–ª—è—Ç—å –ø–æ —Å—É–º–º–µ —Ü–µ–Ω, –ø–æ–º–Ω–æ–∂–µ–Ω–Ω—ã—Ö –Ω–∞ –∫–æ–ª-–≤–æ –µ–¥–∏–Ω–∏—Ü —Ç–æ–≤–∞—Ä–∞ - sum(Price*Quantity). –ü–æ –ø–æ–ª—É—á–µ–Ω–Ω–æ–º—É OrderID –≤—ã–≤–µ—Å—Ç–∏ –Ω–µ–æ–±—Ö–æ–¥–∏–º—ã–µ –¥–∞–Ω–Ω—ã–µ.
#–ò–ª—å—è: –°–∫–æ—Ä—Ä–µ–∫—Ç–∏—Ä–æ–≤–∞–ª

   OrderID  ProductID             ProductName  Quantity
0    10372         20  Sir Rodney's Marmalade        12
1    10372         38           C√¥te de Blaye        40
2    10372         60       Camembert Pierrot        70
3    10372         72  Mozzarella di Giovanni        42

In [62]:
#5.–ö–∞–∫–æ–π —Ç–æ–≤–∞—Ä –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –µ–¥–∏–Ω–∏—Ü —Ç–æ–≤–∞—Ä–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –µ–¥–∏–Ω–∏—Ü –≤ –∫–∞–∂–¥–æ–º –∏–∑ –∑–∞–∫–∞–∑–æ–≤.

tasks+=1
pd.read_sql(
    '''
     
  SELECT P.ProductID, ProductName, SUM(Quantity) AS TotalQuantity
  FROM Products P left join OrderDetails O on P.ProductID=O.ProductID
  GROUP BY P.ProductID
  ORDER BY SUM(Quantity) DESC
  LIMIT 1
    
    ''',
    con,
)

#–ê–ª–µ–∫—Å–µ–π: –ù—É–∂–Ω–æ –Ω–∞–π—Ç–∏ ProductID —Ç–æ–≤–∞—Ä–∞, —É –∫–æ—Ç–æ—Ä–æ–≥–æ –±—ã–ª–æ –∑–∞–∫–∞–∑–∞–Ω–æ –Ω–∞–∏–±–æ–ª—å—à–µ–µ –∫–æ–ª-–≤–æ –µ–¥–∏–Ω–∏—Ü —Ç–æ–≤–∞—Ä–∞ –∏ –≤—ã–≤–µ—Å—Ç–∏ –ø–æ –Ω–µ–º—É –Ω–µ–æ–±—Ö–æ–¥–∏–º—É—é –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—é - –Ω–∞–∑–≤–∞–Ω–∏–µ –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –µ–¥–∏–Ω–∏—Ü –≤ –∫–∞–∂–¥–æ–º –∏–∑ –∑–∞–∫–∞–∑–æ–≤.
#–ò–ª—å—è: –°–∫–æ—Ä—Ä–µ–∫—Ç–∏—Ä–æ–≤–∞–ª

   ProductID        ProductName  TotalQuantity
0         31  Gorgonzola Telino            458

In [63]:
#6.–í—ã–≤–µ–¥–∏—Ç–µ —Ç–æ–ø 5 –ø–æ—Å—Ç–∞–≤—â–∏–∫–æ–≤ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è, —Å—Ç—Ä–∞–Ω—É, –∫–æ–Ω—Ç–∞–∫—Ç–Ω–æ–µ –ª–∏—Ü–æ –∏ —Ç–µ–ª–µ—Ñ–æ–Ω.

tasks+=1
pd.read_sql(
    '''
    SELECT SupplierName,  Country, ContactName, Phone
    FROM Suppliers S left join Products P on S.SupplierID=P.SupplierID
    left join OrderDetails OD on P.ProductID=OD.ProductID
    GROUP BY SupplierName
    HAVING  count(distinct OrderID)
    ORDER BY SupplierName desc
    LIMIT 5;
    ''',
    con,
)


#–ê–ª–µ–∫—Å–µ–π: –ü–æ—á–µ–º—É —Å–æ—Ä—Ç–∏—Ä–æ–≤–∫–∞ –∏–¥–µ—Ç –ø–æ –∏–º–µ–Ω–∏ –ø–æ—Å—Ç–∞–≤—â–∏–∫–∞ - SupplierName ? –û–Ω–∞ –¥–æ–ª–∂–Ω–∞ –±—ã—Ç—å –ø–æ –∫–æ–ª-–≤—É –∑–∞–∫–∞–∑–æ–≤ - count(distinct OrderID)
#–ò–ª—å—è: –°–∫–æ—Ä—Ä–µ–∫—Ç–∏—Ä–æ–≤–∞–ª

                SupplierName      Country    ContactName           Phone
0        Zaanse Snoepfabriek  Netherlands    Dirk Luchte    (12345) 1212
1              Tokyo Traders        Japan   Yoshi Nagase  (03) 3555-5011
2          Svensk Sj√∂f√∂da AB       Sweden  Michael Bj√∂rn    08-123 45 67
3   Specialty Biscuits, Ltd.           UK   Peter Wilson  (161) 555-4448
4  Refrescos Americanas LTDA       Brazil    Carlos Diaz   (11) 555 4640

In [64]:
#7.–ö–∞–∫—É—é –∫–∞—Ç–µ–≥–æ—Ä–∏—é —Ç–æ–≤–∞—Ä–æ–≤ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –ø–æ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –≤ –ë—Ä–∞–∑–∏–ª–∏–∏, –≤—ã–≤–µ–¥–∏—Ç–µ —Å—Ç—Ä–∞–Ω—É, –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ –∏ —Å—É–º–º—É.

tasks+=1
pd.read_sql(
    '''
    SELECT Country, CategoryName, sum(Price*Quantity) as TOTAL_Price
    FROM Categories  left join Products on Categories.CategoryID=Products.CategoryID
    left join OrderDetails on Products.ProductID=OrderDetails.ProductID
    left join Orders on OrderDetails.OrderID=Orders.OrderID
    left join Customers on Orders.CustomerID=Customers.CustomerID
    where Country = 'Brazil'
    GROUP BY CategoryName
    ORDER BY TOTAL_Price desc
    ''',
    con,
)

#–ê–ª–µ–∫—Å–µ–π: "ORDER BY Price desc" - –æ–ø—Ä–µ–¥–µ–ª—è–µ—Ç—Å—è –ø–æ –º–∞–∫—Å–∏–º–∞–ª—å–Ω–æ–π —Ü–µ–Ω–µ –æ–¥–Ω–æ–π –µ–¥–∏–Ω–∏—Ü—ã —Ç–æ–≤–∞—Ä–∞. –û–±—â—É—é —Å—É–º–º—É –Ω—É–∂–Ω–æ –æ–ø—Ä–µ–¥–µ–ª—è—Ç—å –ø–æ —Å—É–º–º–µ —Ü–µ–Ω, –ø–æ–º–Ω–æ–∂–µ–Ω–Ω—ã—Ö –Ω–∞ –∫–æ–ª-–≤–æ –µ–¥–∏–Ω–∏—Ü —Ç–æ–≤–∞—Ä–∞ - sum(Price*Quantity).
#–ò–ª—å—è: –°–∫–æ—Ä—Ä–µ–∫—Ç–∏—Ä–æ–≤–∞–ª

  Country    CategoryName  TOTAL_Price
0  Brazil       Beverages     13690.00
1  Brazil     Confections      6307.30
2  Brazil         Produce      6205.45
3  Brazil  Dairy Products      5491.60
4  Brazil    Meat/Poultry      4780.85
5  Brazil      Condiments      2748.95
6  Brazil         Seafood       991.10

In [65]:
#8. –ö–∞–∫–∞—è —Ä–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –º–µ–∂–¥—É —Å–∞–º—ã–º –¥–æ—Ä–æ–≥–∏–º –∏ —Å–∞–º—ã–º –¥–µ—à–µ–≤—ã–º –∑–∞–∫–∞–∑–æ–º –∏–∑ –°–®–ê.

tasks+=1
pd.read_sql(
    '''
   
   WITH OP AS (
    SELECT Orders.OrderID, SUM(OrderDetails.quantity * Products.price) AS total_price
    FROM Categories left join Products on Categories.CategoryID=Products.CategoryID
    left join OrderDetails on Products.ProductID=OrderDetails.ProductID
    left join Orders on OrderDetails.OrderID=Orders.OrderID
    left join Customers on Orders.CustomerID=Customers.CustomerID
    where Country = 'USA'
    GROUP BY Orders.OrderID
),
MaxMinPrices AS (
    SELECT MAX(total_price) AS max_price, MIN(total_price) AS min_price
    FROM OP
)

SELECT (max_price - min_price) AS price_difference
FROM MaxMinPrices;
   
    ''',
    con,
)

   price_difference
0           7638.45

In [66]:
#9.–í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ —É –∫–∞–∂–¥–æ–≥–æ –∏—Ö —Ç—Ä–µ—Ö —Å–∞–º—ã—Ö –º–æ–ª–æ–¥—ã—Ö —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤, –∞ —Ç–∞–∫–∂–µ –∏–º—è –∏ —Ñ–∞–º–∏–ª–∏—é –≤–æ –≤—Ç–æ—Ä–æ–π –∫–æ–ª–æ–Ω–∫–µ.

tasks+=1
pd.read_sql(
    '''
SELECT 
  count(o.OrderID) as NumberOfOrders,
  e.FirstName || ' ' || e.LastName AS EmployeeName,
  SUBSTR(e.BirthDate, 9, 2) || '-' || SUBSTR(e.BirthDate, 6, 2) || '-' || SUBSTR(e.BirthDate, 1, 4) as NewBirthDateString
from Employees e join Orders o on e.EmployeeID = o.EmployeeID
where e.EmployeeID in (
  SELECT EmployeeID
  FROM Employees
  ORDER BY BirthDate DESC
  LIMIT 3
)
GROUP BY e.EmployeeID
ORDER BY NewBirthDateString desc;
  
    ''',
    con,
)


#–ê–ª–µ–∫—Å–µ–π: –ù—É–∂–Ω–æ —Å–æ—Å—Ç–∞–≤–∏—Ç—å –Ω–æ–≤—É—é –¥–∞—Ç—É –≤ –≤–∏–¥–µ —Å—Ç—Ä–æ–∫–∏(—Å –ø–æ–º–æ—â—å—é substr) –∏ –æ–ø—Ä–µ–¥–µ–ª—è—Ç—å –ø–æ—Ä—è–¥–æ–∫ –ø–æ —ç—Ç–æ–π –Ω–æ–≤–æ–π —Å—Ç—Ä–æ–∫–µ.
#–ò–ª—å—è: –°–∫–æ—Ä—Ä–µ–∫—Ç–∏—Ä–æ–≤–∞–ª

   NumberOfOrders      EmployeeName NewBirthDateString
0              31   Janet Leverling         63-.1-30.0
1              14       Robert King         60-.1-29.0
2              40  Margaret Peacock         58-.1-19.0

In [100]:
#10.–°–∫–æ–ª—å–∫–æ –±–∞–Ω–æ–∫ –∫—Ä–∞–±–æ–≤–æ–≥–æ –º—è—Å–∞ –≤—Å–µ–≥–æ –±—ã–ª–æ –∑–∞–∫–∞–∑–∞–Ω–æ.

tasks+=1
pd.read_sql(
    '''   
    select (sum*Unit_Crab) as total_crab
    from 
    (SELECT ProductName, sum(Quantity) as sum, substr(Unit, 1, 3) as Unit_Crab
    FROM Products left join OrderDetails on Products.ProductID=OrderDetails.ProductID
    where ProductName = 'Boston Crab Meat')
      
    ''',
    con,
)

# –ê–ª–µ–∫—Å–µ–π: –ò–∑ —Ç–∞–±–ª–∏—Ü—ã Products, –∫–æ–ª–æ–Ω–∫–∏ Unit –Ω—É–∂–Ω–æ –±—ã–ª–æ –≤—ã—Ç–∞—â–∏—Ç—å "24" –∏ –µ–≥–æ —É–º–Ω–æ–∂–∏—Ç—å –Ω–∞ —Å—É–º–º—É Quantity ("24 - 4 oz tins" - –æ–∑–Ω–∞—á–∞–µ—Ç "24 –±–∞–Ω–∫–∏ –ø–æ 4 —É–Ω—Ü–∏–∏").
# –ò–ª—å—è: —Å–∫–æ—Ä—Ä–µ–∫—Ç–∏—Ä–æ–≤–∞–ª

   total_crab
0        6144

In [68]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ